/******************************************************************************
 * @File: rtos.c
 * @Author: Milandr, L.
 * @Project: Demo_Project_10-1
 * @Version: 1.0.0
 * @Compiler: ARM Compiler V5.06 (build 750)
 * @Microcontroller: К1986ВЕ92QI
 * @Device: Отладочная плата «МилКиТЭС»
 * @Date: 04.06.2020
 * @Purpose: Инициализация операционной системы реального времени
 ******************************************************************************/

// Подключение заголовка
#include "rtos.h"

// Инициализация ОСРВ
void RTOS_Init(void)
{
}
