/******************************************************************************
 * @File: led.h
 * @Author: Milandr, L.
 * @Project: Demo_Project_10-2
 * @Version: 1.0.0
 * @Compiler: ARM Compiler V5.06 (build 750)
 * @Microcontroller: К1986ВЕ92QI
 * @Device: Отладочная плата «МилКиТЭС»
 * @Date: 09.06.2020
 * @Purpose: Конфигурация портов для работы светодиодов
 ******************************************************************************/

// Условная компиляция
#ifndef __LED_H
#define __LED_H

// Подключение заголовков
#include "link.h"

// Прототипы функций
void LED_Init(void);

#endif
