#include "MDR32Fx.h"                    // Device header
#include "milkites_delay.h"

/*------------------------------------------------------------------*/
uint16_t sec_counter = 0;

void Timer1_init(void)
{ // настройка Т1 на генерирование прерывания каждую секунду
MDR_RST_CLK->TIM_CLOCK |= (1<< 24); // вкл. тактирование Таймера 1
MDR_TIMER1->CNTRL = 0x00000000; // режим счета – вверх,
// начальное значение – число из регистра CNT
MDR_TIMER1->PSG = 7999; // предделитель частоты
MDR_TIMER1->ARR = 999; // основание счета = CNT + 1 = 1000
MDR_TIMER1->CNT = 0; // начальное 

MDR_TIMER1->IE = 2; // разрешение генерир. прерывание при CNT=ARR
}
/*------------------------------------------------------------------*/

/*------------------------------------------------------------------*/
void Timer1_IRQHandler(void)
{ // обработчик прерывания от Т1
sec_counter++; // инкремент счетчика секунд
MDR_TIMER1->CNT = 0; // сброс счетчика таймера
MDR_TIMER1->STATUS = 0; // сброс статуса прерывания
NVIC_ClearPendingIRQ(Timer1_IRQn); // сброс статуса прерывания
}
/*------------------------------------------------------------------*/

/*------------------------------------------------------------------*/
void Timer1_start(void)
{
MDR_TIMER1->CNTRL = 1; // команда запуска Таймера 1
}
/*------------------------------------------------------------------*/

