/******************************************************************************
 * @File: main.c
 * @Author: Milandr, L.
 * @Project: Demo_Project_6-2
 * @Version: 1.0.0
 * @Compiler: ARM Compiler V5.06 (build 750)
 * @Microcontroller: К1986ВЕ92QI
 * @Device: Отладочная плата «МилКиТЭС»
 * @Date: 19.05.2020
 * @Purpose: Основной модуль
 * @Description:
 * В данном проекте реализована генерация периодического сигнала заданной формы
 * средствами ЦАП и DMA. Параметры сигнала задаются через структуру signal_t
 * и отображаются на дисплей.
 ******************************************************************************/

// Подключение заголовка
#include "main.h"

// Основная функция
int main(void)
{
  // Общая инициализация
  CPU_Init();   // Система тактирования
  LCD_Init();   // ЖК-дисплей

  // Инициализация ЦАП
  DAC_Init();

  // Параметры сигнала
  signal_t sine = {
    .constant  = 1.20,   // Константа (в вольтах)
    .amplitude = 0.70,   // Амплитуда (в вольтах)
    .frequency = 2000,   // Частота (в герцах)
    .waveform  = SINE,   // Форма
    .buffer    = sample  // Буфер
  };

  // Формирование дискретного сигнала (синусоида)
  DAC_GenerateWaveform(&sine);

  // Основной цикл
  while (true) {
  }
}
