/******************************************************************************
 * @File: main.c
 * @Author: Milandr, L.
 * @Project: Demo_Project_10-1
 * @Version: 1.0.0
 * @Compiler: ARM Compiler V5.06 (build 750)
 * @Microcontroller: К1986ВЕ92QI
 * @Device: Отладочная плата «МилКиТЭС»
 * @Date: 04.06.2020
 * @Purpose: Основной модуль
 * @Description:
 * 
 * 
 * 
 ******************************************************************************/

// Подключение заголовка
#include "main.h"

// Основная функция
int main(void)
{
  // Общая инициализация
  CPU_Init();   // Система тактирования
  BTN_Init();   // Кнопки

  // Инициализация светодиодов
  LED_Init();

  // Основной цикл
  while (true) {
  }
}
